"""
Каждый класс реализовать в отдельном модуле, импортируя их в производные модули.
Создать класс Item с полями название, цена. Добавить конструктор класса.
Создать производный от Item класс Drink. Новые поля: объем напитка, раздел меню. Определить конструктор, с вызовом родительского конструктора. Переопределить
    метод преобразования в строку для печати основной информации (название, раздел меню, объем, цена).
Создать производный от Item класс Food. Новые поля: масса блюда, время приготовления. Определить конструктор, с вызовом родительского конструктора. 
    Определить функции изменения времени приготовления. Переопределить метод
    преобразования в строку для печати основной информации (название, масса, цена, время приготовления).
Создать класс Menu. Поля: название ресторана, адрес, список напитков (список экземпляров класса Drink), список
    горячих блюд (список экземпляров класса Food). Определить конструктор. Переопределить метод преобразования
    в строку для печати всей информации о меню (с использованием переопределения в классах Drink и Food).
    Переопределить методы получения количества пунктов меню функцией len, получения напитка/блюда по индексу,
    изменения по индексу, удаления по индексу (пусть вначале идут индексы напитков, затем горячих блюд).
    Переопределить операции + и - для добавления или удаления пункта меню. Добавить функцию создания txt-файла
    и записи всей информации в него (в том числе списков ингредиентов напитков и блюд).
Предусмотреть хотя бы в 3 местах обработку возможных исключений.
В каждом модуле провести подробное тестирование всех создаваемых объектов и функций.
"""

from item import Item
from menu import Menu
from drink import Drink
from food import Food

menu = Menu("Ресторан 'Моя кухня'", "ул. Пушкина, д.10")

coffee = Drink("Кофе", 150, 250, "Горячие напитки")
tea = Drink("Чай", 100, 200, "Горячие напитки")

menu += coffee
menu += tea

menu += Food("Салат", 250, 200, 10)
menu += Food("Суп", 300, 300, 20)

del menu[3]

menu.create_txt_file("menu.txt")