#include <iostream>
#include <bitset>
using namespace std;

void FirstTask() {
    cout << "Маска устанавливает с 9-ого бита четыре слева в значение 1" << endl;

    //Определение переменной целого типа
    int var1;

    //Присвоение переменной значения из константы в шестнадцатеричной системе
    var1 = 0x75; //01110101 в бинарной

    //Маска устанавливает с 9-ого бита четыре слева в значение 1
    unsigned short int mask = 0x1E00;

    //Применение поразрядной операции "ИЛИ" используя маску
    var1 |= mask;

    //Вывод результата в бинарном виде
    cout << "Результат (2 СС): " << bitset<sizeof(int) * 8>(var1) << endl;
    //И в десятичном
    cout << "Результат (10 СС): " << var1 << endl;
}

void SecondTask() {
    cout << "Маска обнуляет 17-й, 15-й и 1-й биты" << endl;

    //Определение переменной целого типа
    int var2;

    //Ввод значения с клавиатуры
    cout << "Значение переменной var2: "; cin >> var2;

    //Реализация маски
    unsigned int mask = 0xFFFD7FFD; // 11111111111111010111111111111101 в бинарной
    
    //Обнуление битов согласно маске используя поразрядную операцию
    var2 = var2 & mask;

    //Вывод результата в бинарном виде
    cout << "Результат (2 СС): " << bitset<sizeof(int) * 8>(var2) << endl;
    //И в десятичном
    cout << "Результат (10 СС): " << var2 << endl;
}

void ThirdTask() {
    cout << "Умножение значения переменной на 1024 с использованием поразрядной операции" << endl;

    //Определение переменной целого типа
    int var3;

    //Ввод значения с клавиатуры
    cout << "Значение переменной var3: "; cin >> var3;

    //Умножение значения переменной на 1024 с использованием поразрядной операции
    var3 = var3 << 10; //Сдвиг влево на 10 бит эквивалентен умножению 2^10 = 1024

    //Вывод результата в бинарном виде
    cout << "Результат (2 СС): " << bitset<sizeof(int) * 8>(var3) << endl;
    //И в десятичном
    cout << "Результат (10 СС): " << var3 << endl;
}

void FourthTask() {
    cout << "Деление значения переменной на 1024 с использованием поразрядной операции" << endl;

    //Определение переменной целого типа
    int var4;

    //Ввод значения с клавиатуры
    cout << "Значение переменной var4: "; cin >> var4;

    //Деление значения переменной на 1024 с использованием поразрядной операции
    var4 = var4 >> 10; //Сдвиг вправо на 10 бит эквивалентен делению 2^10 = 1024

    //Вывод результата в бинарном виде
    cout << "Результат (2 СС): " << bitset<sizeof(int) * 8>(var4) << endl;
    //И в десятичном
    cout << "Результат (10 СС): " << var4 << endl;
}

void FifthTask() {
    cout << "Присваивание с использованием поразрядной операции" << endl;

    //Определение переменной целого типа
    int var5;

    //Иниализация маски (единица в мл. разряде)
    int mask = 1;

    //Ввод значения с клавиатуры
    cout << "Значение переменной var5: "; cin >> var5;

    //Присваивание с использованием поразрядной операции
    var5 |= mask;

    //Вывод результата в бинарном виде
    cout << "Результат (2 СС): " << bitset<sizeof(int) * 8>(var5) << endl;
    //И в десятичном
    cout << "Результат (10 СС): " << var5 << endl;
}

int main() {
    setlocale(LC_ALL, "RUS");
    FirstTask();
    SecondTask();
    ThirdTask();
    FourthTask();
    FifthTask();
    return 0;
}